import os
from dotenv import load_dotenv

# Загрузка переменных окружения из файла .env
load_dotenv()

# Токен бота (берется из конфига безопасности дя удобства)
BOT_TOKEN = os.getenv("DISCORD_TOKEN")

# Настройки Discord сервера
GUILD_ID = 1369602490709966891  # ID твоего сервера ZOV

# Настройки паттерна "ZOV Guard"
QUARANTINE_MINUTES = 15         # Время наблюдения за новичком без тега
IMMUNITY_SECONDS = 30           # Время абсолютного иммунитета сразу после захода
MEDIA_CHECK_WINDOW = 120        # Окно анализа медиа-сообщений (2 минуты)

# Лимиты детекта спама
MAX_MEDIA_COUNT = 6             # Сколько медиа разрешено отправить за 2 минуты
MIN_UNIQUE_MEDIA = 3            # Если уникальных медиа меньше или равно этому числу — это спам
